InformationRegisters/СопоставлениеКлассификатораОграниченийСОбъектамиБЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеКлассификатораОграниченийСОбъектамиБЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеОграничения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗначенияОграничения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСопоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОграничения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗначенияОграничения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СопоставлениеКлассификатораОграниченийСОбъектамиБЭД/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

// Добавляет записи сопоставленных объектов учета БЭД с элементами классификатора значений ограничений полномочий МЧД
// в РегистрСведений.СопоставлениеКлассификатораОграниченийСОбъектамиБЭД.
//
// Параметры:
// Параметры - Структура - параметры обработки обновления.
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.СопоставлениеКлассификатораОграниченийСОбъектамиБЭД;
	
	ОбработкаЗавершена = Ложь;
	
	Попытка
		
		ОбменСКонтрагентамиИнтеграция.СоответствиеВидовЭДВидамДокументовЭДО();
		
		ИмяМакета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("СписокСопоставленныхОбъектовБЭД_%1", 
			ОбщегоНазначения.КодОсновногоЯзыка());
			
		ДвоичныеДанные = ПолучитьМакет(ИмяМакета);
		ОбновитьНастройки(ДвоичныеДанные);
		
		ОбработкаЗавершена = Истина;
		
		ТекстСообщения = НСтр("ru = 'Заполнен регистр сопоставлений классификатора ограничений и объектов учета БЭД'");
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения =
			НСтр("ru = 'Не удалось обработать регистр сопоставлений классификатора ограничений и объектов учета БЭД по причине:'") +
			Символы.ПС + ТекстОшибки;
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение, МетаданныеОбъекта,, ТекстСообщения);
		
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обновляет настройки сопоставления классификатора ограничений с объектами БЭД.
// 
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные
Процедура ОбновитьНастройки(Знач ДвоичныеДанные) Экспорт
	
	ТекстовыйДокумент = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
	Данные = ОбщегоНазначения.JSONВЗначение(ТекстовыйДокумент,, Ложь);
	
	ТаблицаСопоставлений = НовыйТаблицаСопоставлений();
	
	Для Каждого ТекущийНаборДанных Из Данные Цикл
		
		НоваяСтрока = ТаблицаСопоставлений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийНаборДанных);
		
		Попытка
			ТипДокументаСсылка = Перечисления.ТипыДокументовЭДО[ТекущийНаборДанных.ТипДокументаЭДО];
		Исключение
			ТипДокументаСсылка = Перечисления.ТипыДокументовЭДО.ПустаяСсылка();
		КонецПопытки;
		
		НоваяСтрока.ТипДокументаСсылка = ТипДокументаСсылка;
		НоваяСтрока.УникальныйИдентификатор = Новый УникальныйИдентификатор(ТекущийНаборДанных.ГУИД);
		
	КонецЦикла;
	
	ЗаполнитьСопоставленияКлассификатораОграниченийСОбъектамиБЭД(ТаблицаСопоставлений); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет сопоставления классификатора ограничений с объектами БЭД.
// 
// Параметры:
//  ТаблицаСопоставлений - см. ПрочитатьCSV
//
Процедура ЗаполнитьСопоставленияКлассификатораОграниченийСОбъектамиБЭД(ТаблицаСопоставлений)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		УстановитьТекстИПараметрыЗапросаПолучитьСоответствиеДанныхКлассификатораСВидамиДокументовЭДО(Запрос, ТаблицаСопоставлений);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
		
		Если Не ОбновлениеИнформационнойБазы.ЭтоВызовИзОбработчикаОбновления() Тогда
			УдалитьДублиПоТекущемуНаборуСопоставлений(РезультатЗапроса.Выгрузить());
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			НовыйНаборЗаписей = СоздатьНаборЗаписей();
			НовыйНаборЗаписей.Отбор.УникальныйИдентификатор.Установить(Выборка.УникальныйИдентификатор);
			ЗаполнитьЗначенияСвойств(НовыйНаборЗаписей.Добавить(), Выборка);
			
			НовыйНаборЗаписей.ДополнительныеСвойства.Вставить("Синхронизация", Истина);
			
			Если ОбновлениеИнформационнойБазы.ЭтоВызовИзОбработчикаОбновления() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйНаборЗаписей);
			Иначе
				НовыйНаборЗаписей.Записать(Истина);
			КонецЕсли;
		
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВидОперации = НСтр("ru = 'Обновление регистра сопоставлений классификатора ограничений и объектов учета БЭД.'");
		ЭлектронноеВзаимодействие.ОбработатьОшибку(ВидОперации, ТекстОшибки);
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Возвращаемое значение:
//  ТаблицаЗначений 
//
Функция НовыйТаблицаСопоставлений()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Результат.Колонки.Добавить("КодОграничения", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("КодЗначенияОграничения", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("НаименованиеОграничения", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("НаименованиеЗначенияОграничения", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("ТипДокументаСсылка", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДокументовЭДО"));
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Запрос - Запрос
//  Классификатор - См. ПрочитатьCSV
//
Процедура УстановитьТекстИПараметрыЗапросаПолучитьСоответствиеДанныхКлассификатораСВидамиДокументовЭДО(Запрос, Знач Классификатор)

	ТекстЗапроса = "ВЫБРАТЬ
	               |	Классификатор.УникальныйИдентификатор КАК УникальныйИдентификатор,
	               |	Классификатор.КодОграничения КАК КодОграничения,
	               |	Классификатор.КодЗначенияОграничения КАК КодЗначенияОграничения,
	               |	Классификатор.НаименованиеОграничения КАК НаименованиеОграничения,
	               |	Классификатор.НаименованиеЗначенияОграничения КАК НаименованиеЗначенияОграничения,
	               |	Классификатор.ТипДокументаСсылка КАК ТипДокументаСсылка
	               |ПОМЕСТИТЬ ВТ_Классификатор
	               |ИЗ
	               |	&Классификатор КАК Классификатор
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ТипДокументаСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВидыДокументовЭДО.Ссылка КАК ОбъектСопоставления,
	               |	ВТ_Классификатор.УникальныйИдентификатор КАК УникальныйИдентификатор,
	               |	ВТ_Классификатор.КодОграничения КАК КодОграничения,
	               |	ВТ_Классификатор.КодЗначенияОграничения КАК КодЗначенияОграничения,
	               |	ВТ_Классификатор.НаименованиеОграничения КАК НаименованиеОграничения,
	               |	ВТ_Классификатор.НаименованиеЗначенияОграничения КАК НаименованиеЗначенияОграничения
	               |ИЗ
	               |	Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Классификатор КАК ВТ_Классификатор
	               |		ПО ВидыДокументовЭДО.ТипДокумента = ВТ_Классификатор.ТипДокументаСсылка";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Классификатор", Классификатор);

КонецПроцедуры	

// Параметры:
//  Запрос - Запрос
//  ТаблицаКлючевыхПолей - См. НовыйТаблицаСопоставлений
Процедура УстановитьТекстИПараметрыЗапросаПолучитьДублиПоТекущемуНаборуЗаписей(Запрос, Знач ТаблицаКлючевыхПолей) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
				   |	НаборЗаписей.УникальныйИдентификатор КАК УникальныйИдентификатор,
				   |	НаборЗаписей.ОбъектСопоставления КАК ОбъектСопоставления,
	               |	НаборЗаписей.КодОграничения КАК КодОграничения,
	               |	НаборЗаписей.КодЗначенияОграничения КАК КодЗначенияОграничения
	               |ПОМЕСТИТЬ ВТ_НовыйНабор
	               |ИЗ
	               |	&НаборЗаписей КАК НаборЗаписей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ТаблицаРегистра.УникальныйИдентификатор КАК УникальныйИдентификатор,
	               |	ТаблицаРегистра.ОбъектСопоставления КАК ОбъектСопоставления,
	               |	ТаблицаРегистра.КодОграничения КАК КодОграничения,
	               |	ТаблицаРегистра.КодЗначенияОграничения КАК КодЗначенияОграничения
	               |ИЗ
	               |	РегистрСведений.СопоставлениеКлассификатораОграниченийСОбъектамиБЭД КАК ТаблицаРегистра
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НовыйНабор КАК ВТ_НовыйНабор
	               |		ПО ТаблицаРегистра.ОбъектСопоставления = ВТ_НовыйНабор.ОбъектСопоставления
	               |			И ТаблицаРегистра.КодОграничения = ВТ_НовыйНабор.КодОграничения
	               |			И ТаблицаРегистра.КодЗначенияОграничения = ВТ_НовыйНабор.КодЗначенияОграничения
	               |			И ТаблицаРегистра.УникальныйИдентификатор <> ВТ_НовыйНабор.УникальныйИдентификатор";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НаборЗаписей", ТаблицаКлючевыхПолей);
	
КонецПроцедуры

Процедура УдалитьДублиПоТекущемуНаборуСопоставлений(Знач РезультатЗапроса)
	
	ТаблицаКлючевыхПолей = РезультатЗапроса.Скопировать(,
		"УникальныйИдентификатор, ОбъектСопоставления, КодОграничения, КодЗначенияОграничения");
	Запрос = Новый Запрос;
	УстановитьТекстИПараметрыЗапросаПолучитьДублиПоТекущемуНаборуЗаписей(Запрос, ТаблицаКлючевыхПолей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборУдаляемыхЗаписей = СоздатьНаборЗаписей();
		НаборУдаляемыхЗаписей.Отбор.УникальныйИдентификатор.Установить(Выборка.УникальныйИдентификатор);
		НаборУдаляемыхЗаписей.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
